--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    淘气值 增加

]]--
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

return function(inst)
    if not TheWorld.ismastersim then
        return
    end



    inst:ListenForEvent("sia_naughty_dodelta", function(inst,num)
        if type(num) == "number" then
            SpawnPrefab("acute_sia_naughty_target"):PushEvent("Set",{
                player = inst,
                num = num,
            })
        end
    end)







end